/**
 * DFS - поиск в глубину
 * Будем находит количество островов с помощью рекурсивного вызова функции depthSearch
 *
 *
 */
var numIslands = function(grid) {
    let count = 0;//счётчик количества островов

    function depthSearch(x, y) { //осуществим поиск в глубину
        if (grid[x][y] === '1') { //если обнаруживается суша то она зануляется чтобы избежать повторного обхода
            grid[x][y] = '0';
        } else {
            return;
        }

        if (y < grid[x].length - 1) { // Проверяем, можно ли двигаться вправо от текущей клетки
            depthSearch(x, y+1); // Рекурсивный вызов функции для клетки справа
        }

        if (x > 0 && x < grid.length) { // Проверяем, можно ли двигаться вверх от текущей клетки
            depthSearch(x-1, y); // Рекурсивный вызов функции для клетки выше
        }

        if (y > 0 && y < grid[x].length) { // Проверяем, можно ли двигаться влево от текущей клетки
            depthSearch(x, y-1); // Рекурсивный вызов функции для клетки слева
        }
    }

    for (let i = 0; i < grid.length; i++) { // Проходим по строкам карты
        for (let j = 0; j < grid[i].length; j++) { // Проходим по каждой клетке в текущей строке
            if (grid[i][j] === '1') { // Если текущая клетка содержит '1', то это начало нового острова
                count++; // Увеличиваем счетчик островов
                depthSearch(i, j); // Запускаем поиск в глубину для данного острова
            }
        }
    }

    return count;
};
