
var maxProfit = function(prices) {
    // Инициализация переменных для отслеживания левого и правого индексов
    let left = 0;
    let right = 1;
    // Инициализация переменной для хранения максимальной прибыли
    let res = 0;
    // Цикл по массиву цен
    while(right < prices.length) {
        // Если цена слева меньше цены справа, обновляем максимальную прибыль
        if(prices[left] < prices[right]) res = Math.max(res, prices[right] - prices[left]);
        // Если цена слева больше или равна цене справа, переходим к следующей паре
        else left = right;
        // Переход к следующему элементу
        right++;
    }
    // Возврат максимальной прибыли
    return res;
};
