var maxProfit = function(prices) {
    // Инициализация переменной для хранения минимальной цены акции
    var buy = 2147483647; // 2^31 - 1
    // Инициализация переменных для хранения максимальной прибыли в разных состояниях
    var free = 0, last = 0, now = 0;
    // Цикл по массиву цен
    prices.forEach( x => {
        // Расчет прибыли, если продать акции на текущий день
        now = Math.max( last , x - buy);
        // Расчет минимальной цены акции для покупки на текущий день
        buy = Math.min( buy , x - free);
        // Обновление состояний
        free = last;
        last = now;
    });
    // Возврат максимальной прибыли
    return now;
};
