
var maxProfit = function(prices) {
    // Инициализация переменной для хранения максимальной прибыли
    let max = 0;
    // Инициализация переменной для хранения цены акции на начальный день
    let start = prices[0];
    // Получение длины массива цен
    let len = prices.length;
    // Цикл по массиву цен, начиная со второго элемента
    for(let i = 1; i < len; i++){
        // Если цена акции на текущий день больше цены на начальный день
        if(start < prices[i]){
            // Прибавляем к максимальной прибыли разницу между ценой на текущий день и начальной ценой
            max += prices[i] - start;
        }
        // Обновляем начальную цену акции на текущую цену
        start = prices[i];
    }
    // Возврат максимальной прибыли
    return max;
};
