class LinkedNode{
    constructor(data){ //создаем свойства с данными внутри узла и указателем на следующий узел
        this.data = data;
        this.next = null
    }
}
function reverseLinkedList(head){ //создаем функцию, которая принимает на вход голову связного списка
    //и возвращает обратную связную структуру
    let prev = null; //создаем указатель на предыдущий узел - он в начала налл
    let current  = head; //создаем указатель на текущий узел - он в начале списка
    while(current){ //пока текущий указатель не равен null
        let next = current.next; //сохраняем указатель на следующий узел
        current.next = prev; //указатель текущего узла указывает на предыдущий узел
        prev = current; //указатель предыдущего узла указывает на текущий узел
        current = next //текущий становится следующим
    }
    return prev //возвращаем предыдущий узел - он в конце списка
}
const list = new Li
