/*
У нас есть две перестановки (массивы без повторяющихся элементов) целых чисел A и B
 одинаковой длины n. Нам нужно найти префикс-общий массив для этих двух перестановок.
  Префикс-общий массив - это массив C такой, что C[i] равно количеству чисел,
   которые присутствуют на или до индекса i как в A, так и в B.

Для примера, рассмотрим массивы:

A = [1, 3, 2, 4]
B = [3, 1, 2, 4]

На индексе 0 в обоих массивах нет общих чисел, так что C[0] будет равно 0.
На индексе 1 общие числа - 1 и 3, так что C[1] будет равно 2.
На индексе 2 общие числа - 1, 2 и 3, так что C[2] будет равно 3.
На индексе 3 общие числа - 1, 2, 3 и 4, так что C[3] будет равно 4.
 */
/*
Это решение использует множество (Set) для отслеживания уникальных чисел в обоих массивах A и B.
 Затем оно проходит по обоим массивам одновременно (используя один и тот же индекс),
  обновляя счетчик общих чисел и записывая его в результирующий массив prefixArr.
 */

var findThePrefixCommonArray = function(A, B) {
    const set = new Set();
    let prefixArr = []; //результирующий массив
    let counter=0;
    for(let i=0; i<A.length; i++){
        if(set.has(A[i])){
            counter++
        }
        set.add(A[i]);
        if(set.has(B[i])){
            counter +=1 ;
        }
        set.add(B[i]);
        prefixArr[i] = counter;
    }
    return prefixArr;
};
console.log(findThePrefixCommonArray(A = [1,3,2,4], B = [3,1,2,4]))
