/**
 * Дан массив, содержащий глубоко вложенные массивы (массивы внутри массивов).
 * Необходимо написать функцию для "выравнивания" этого массива,
 * то есть преобразования его в одномерный массив, содержащий все элементы исходного массива
 * в том же порядке.
 */
/*
Input
arr = [1, 2, 3, [4, 5, 6], [7, 8, [9, 10, 11], 12], [13, 14, 15]]
n = 0
Output
[1, 2, 3, [4, 5, 6], [7, 8, [9, 10, 11], 12], [13, 14, 15]]

 */
/**
 *
 * O(n), где n - общее количество элементов во всех вложенных массивах.
 *
 * Однако, стоит учитывать, что в наихудшем случае метод flat() может работать за O(n^2),
 */
//с флат быстрее
function flatten(arr,n){
   const newArr = arr.flat(n)
    return newArr
}


//Без flat
function flatten2(arr,n){
    const result =[];
    for (const elem of arr) {
        if(Array.isArray(elem) && n>0){
            result.push(...flatten2(elem, n - 1));
        }else {
            result.push(elem);
        }
    }
    return result
}

console.log(flatten([1, [2, [3, 4], 5], 6],2))

console.log(flatten2([1, [2, [3, 4], 5], 6],1))
