/**
 * Разработайте счетчик хитов, который подсчитывает количество полученных хитов за последние 5 минут
 * (т.е. за последние 300 секунд).
 *
 * Ваша система должна принимать параметр временной метки (с точностью до секунд),
 * и вы можете предположить, что вызовы к системе происходят в хронологическом порядке
 * (т.е. временная метка монотонно возрастает). Несколько хитов могут прибыть примерно в одно и то же время.
 *
 * Реализуйте класс HitCounter:
 *
 * HitCounter() - инициализирует объект системы счетчика хитов.
 * void hit(int timestamp) - записывает хит, который произошел во временной метке timestamp (в секундах). Несколько хитов могут произойти в одной и той же временной метке.
 * int getHits(int timestamp) - возвращает количество хитов за последние
 * 5 минут от метки времени timestamp (т.е. за последние 300 секунд).
 *
 * Input
 * ["HitCounter", "hit", "hit", "hit", "getHits", "hit", "getHits", "getHits"]
 * [[], [1], [2], [3], [4], [300], [300], [301]]
 * Output
 * [null, null, null, null, 3, null, 4, 3]
 */
class HitCounter {
    constructor() {
        this.hits = []; // Массив хитов за последние 5 минут
    }

    hit(timestamp) {
        this.hits.push(timestamp); // Добавляем хит в массив
    }

    getHits(timestamp) { // Возвращаем количество хитов за последние 5 минут
        while (this.hits.length > 0 && this.hits[0] <= timestamp - 300) { //если массив е пустой и или время первого хита меньше 300 секунд
            this.hits.shift(); //то удаляем первый элемент
        }
        return this.hits.length; //возвращаем количество хитов
    }
}
