//Longest Subarray of 1's After Deleting One Element
/**
 *
 * В данной задаче стоит вопрос о том, как найти наибольшую длину подмассива,
 * состоящего из единиц в массиве nums, после удаления ровно одного элемента.
 * То есть, вопрос заключается в определении наибольшей длины подмассива из единиц,
 * которую можно получить после удаления одного элемента из исходного массива nums.
 *
 */

var longestSubarray = function(nums) {
    let left = 0; //левая граница текущего подмассива
    let maxLength = 0; // счетчик для максимальной длины подмассива
    let zeroCount = 0; // счетчик для количества нулей в подмассиве

    for (let right = 0; right < nums.length; right++) {
        if (nums[right] === 0) { // если в подмассиве есть ноль
            zeroCount++; // то увеличиваем счетчик нулей
        }

        while (zeroCount > 1) { //пока счетчик нулей больше 1
            if (nums[left] === 0) { //если в подмассиве есть ноль
                zeroCount--; //то уменьшаем счетчик нулей
            }
            left++; //иначе увеличиваем левую границу подмассива
        }

        maxLength = Math.max(maxLength, right - left); // обновляем максимальную длину подмассива (максимум из максимальной длины и текущей длины)
    }

    return maxLength;
};

console.log(longestSubarray([1,1,0,1]))
